Atseng733/STM32-Drone/stm32_drone/lib/header/ssd1306.h
#ifndef SSD1306_H
#define SSD1306_H

#include <font.h>
#include <i2c.h>
#include <usart.h>

class ssd1306 {
	private:
		uint8_t addr;
		uint8_t ssd1306_buffer[0x200];
		uint16_t inc_CURSOR_LOC(uint8_t inc);
	public:
		ssd1306() {}
		uint16_t CURSOR_LOC;
		uint8_t CURR_ROW;
		uint8_t CURR_COL;
		uint8_t text_size;
		uint8_t get_addr();
		void ssd1306_command(uint8_t c);
		void begin(uint8_t sAddr);
		void clearDisplay(void);
		void display(void) ;
		
		void print(char* str);
		void setCursor(uint8_t col, uint8_t row);
		void setTextSize(uint8_t size);
};

#define SSD1306_SWITCHCAPVCC 0x2

#define SSD1306_LCDHEIGHT 32
#define SSD1306_LCDWIDTH 128

// Scrolling #defines
#define SSD1306_ACTIVATE_SCROLL 0x2F
#define SSD1306_DEACTIVATE_SCROLL 0x2E
#define SSD1306_SET_VERTICAL_SCROLL_AREA 0xA3
#define SSD1306_RIGHT_HORIZONTAL_SCROLL 0x26
#define SSD1306_LEFT_HORIZONTAL_SCROLL 0x27
#define SSD1306_VERTICAL_AND_RIGHT_HORIZONTAL_SCROLL 0x29
#define SSD1306_VERTICAL_AND_LEFT_HORIZONTAL_SCROLL 0x2A



#define SSD1306_SETCONTRAST 0x81
#define SSD1306_DISPLAYALLON_RESUME 0xA4
#define SSD1306_DISPLAYALLON 0xA5
#define SSD1306_NORMALDISPLAY 0xA6
#define SSD1306_INVERTDISPLAY 0xA7
#define SSD1306_DISPLAYOFF 0xAE
#define SSD1306_DISPLAYON 0xAF

#define SSD1306_SETDISPLAYOFFSET 0xD3
#define SSD1306_SETCOMPINS 0xDA

#define SSD1306_SETVCOMDETECT 0xDB

#define SSD1306_SETDISPLAYCLOCKDIV 0xD5
#define SSD1306_SETPRECHARGE 0xD9

#define SSD1306_SETMULTIPLEX 0xA8

#define SSD1306_SETLOWCOLUMN 0x00
#define SSD1306_SETHIGHCOLUMN 0x10

#define SSD1306_SETSTARTLINE 0x40

#define SSD1306_MEMORYMODE 0x20
#define SSD1306_COLUMNADDR 0x21
#define SSD1306_PAGEADDR   0x22

#define SSD1306_COMSCANINC 0xC0
#define SSD1306_COMSCANDEC 0xC8

#define SSD1306_SEGREMAP 0xA0

#define SSD1306_CHARGEPUMP 0x8D

#define SSD1306_EXTERNALVCC 0x1
#define SSD1306_SWITCHCAPVCC 0x2

#endif